---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntries.GetBasicIEnumerator
source: html/ac518ea0-c6cd-f210-82ed-9bc855cd1861.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntries.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.